TodoList/app/controllers/api/todolists_controller.rb

    def index
        render json: Todolist.all
---
SELECT "todolists".* FROM "todolists"

    def create
        @todo = Todolist.new(todo_params)
        if @todo.save
---
INSERT INTO "todolists" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["body", "test"], ["created_at", "2021-10-21 19:05:50.649001"], ["updated_at", "2021-10-21 19:05:50.649001"]]

    def update
        @todo = Todolist.find_by(id: params[:id])
        if @todo.update(todo_params)
---
SELECT  "todolists".* FROM "todolists" WHERE "todolists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "todolists" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "todolists"."id" = $4  [["title", "after test"], ["body", "after test"], ["updated_at", "2021-10-21 19:07:02.461863"], ["id", 3]]

    def destroy
        @todo = Todolist.find_by(id: params[:id])
        @todo.destroy

        render json: Todolist.all
---
SELECT  "todolists".* FROM "todolists" WHERE "todolists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todolists" WHERE "todolists"."id" = $1  [["id", 3]]
SELECT "todolists".* FROM "todolists"